# More sql

We first import sqlite3 and open/create a new test database

In [4]:
import sqlite3
sqlite_db = 'test_db.sqlite'
conn = sqlite3.connect(sqlite_db)
c = conn.cursor()

We now create a new table.

In [5]:
c.execute('CREATE TABLE houses (field1 INTEGER PRIMARY KEY, sqft INTEGER, bdrms INTEGER, age INTEGER, price INTEGER);')

Unless we wrap the code around a context manager (with), we need to commit after we execute.

In [6]:
conn.commit()

Now we add a row to our table and commit.

In [7]:
last_sale = (None, 4000, 5, 22, 619000)
c.execute('INSERT INTO houses VALUES (?,?,?,?,?)',last_sale)

# Remember to commit the changes
conn.commit()

Please note that we pass the value of None (instead of Null) to indicate that the Primary Key should be out incremented.

We can also excute several inserts at the same time, using executemany.

In [8]:
recent_sales = [
  (None, 2390, 4, 34, 319000),
  (None, 1870, 3, 14, 289000),
  (None, 1505, 3, 90, 269000),
]

c.executemany('INSERT INTO houses VALUES (?, ?, ?, ?, ?)', recent_sales)

conn.commit()

We can also get data from a csv and then insert it in our database.

In [9]:
from numpy import genfromtxt

# import into nparray of ints, then convert to list of lists
# https://docs.scipy.org/doc/numpy/reference/generated/numpy.genfromtxt.html
data = (genfromtxt('assets/datasets/housing-data.csv', dtype='i8',
                    delimiter=',', skip_header=1)).tolist()

# append a None value to beginning of each sub-list
for d in data:
    d.insert(0, None)

In [10]:
data[0:3]

[[None, 2104, 3, 70, 399900],
 [None, 1600, 3, 28, 329900],
 [None, 2400, 3, 44, 369000]]

In [11]:
# loop through data, running an INSERT on each record (i.e. sublist)
for d in data:
    c.execute('INSERT INTO houses VALUES (?, ?, ?, ?, ?)', d)

conn.commit()

We can also retrieve data from the table.

In [12]:
# Similar syntax as before
results = c.execute("SELECT * FROM houses WHERE bdrms = 4")

# Here results is a cursor object - use fetchall() to extract a list
results.fetchall()

[(2, 2390, 4, 34, 319000),
 (9, 3000, 4, 75, 539900),
 (10, 1985, 4, 61, 299900),
 (15, 1940, 4, 7, 239999),
 (20, 2300, 4, 77, 449900),
 (23, 2609, 4, 5, 499998),
 (24, 3031, 4, 21, 599000),
 (28, 1962, 4, 53, 259900),
 (37, 2040, 4, 75, 314900),
 (39, 1811, 4, 24, 285900),
 (42, 2132, 4, 28, 345000),
 (43, 4215, 4, 66, 549000),
 (44, 2162, 4, 43, 287000),
 (47, 2567, 4, 57, 314000),
 (50, 1852, 4, 64, 299900)]

# Pandas and SQL

As usual, we can first load a dataset into a pandas DataFrame.

In [13]:
import pandas as pd

data = pd.read_csv('assets/datasets/housing-data.csv', low_memory=False)
data.head()

   sqft  bdrms  age   price
0  2104      3   70  399900
1  1600      3   28  329900
2  2400      3   44  369000
3  1416      2   49  232000
4  3000      4   75  539900

Data is moved to the database through the to_sql command, similar to the to_csv command.

to_sql takes as arguments: - name, the table name to create - con, a connection to a database - index, whether to input the index column - schema, if we want to write a custom schema for the new table - if_exists, what to do if the table already exists. We can overwrite it, add to it, or fail

In [14]:
data.to_sql('houses_pandas',
            con=conn,
            if_exists='replace',
            index=False)

We can also load data directly from a table.

In [15]:
pd.read_sql('select * from houses_pandas limit 10', con=conn)

   sqft  bdrms  age   price
0  2104      3   70  399900
1  1600      3   28  329900
2  2400      3   44  369000
3  1416      2   49  232000
4  3000      4   75  539900
5  1985      4   61  299900
6  1534      3   12  314900
7  1427      3   57  198999
8  1380      3   14  212000
9  1494      3   15  242500

# SQL SYNTAX

## Select

Every query should start with SELECT. SELECT is followed by the names of the columns in the output.

SELECT is always paired with FROM, and FROM identifies the table to retrieve data from.

```sql
SELECT
<columns>
FROM
<table>
```

```SELECT``` * denotes returns all of the columns.

Housing Data example:
```sql
SELECT
sqft, bdrms
FROM houses_pandas;
```

## Where

WHERE is used to filter table to a specific criteria and follows the FROM clause.

```sql
SELECT
<columns>
FROM
<table>
WHERE
<condition>
```
Example:

```sql
SELECT
sqft, bdrms, age, price
FROM houses_pandas
WHERE bdrms = 2 and price < 250000;
```

The condition is some filter applied to the rows, where rows that match the condition will be in the output.

## AGGREGATIONS

Aggregations (or aggregate functions) are functions where the values of multiple rows are grouped together as input on certain criteria to form a single value of more significant meaning or measurement such as a set, a bag or a list.

Examples of aggregate functions:

Average (i.e., arithmetic mean)
Count

Maximum

Minimum

Median

Mode

Sum

In SQL they are performed in a SELECT statement as follows.

```sql
SELECT COUNT(price)
FROM houses_pandas;
SELECT AVG(sqft), MIN(price), MAX(price)
FROM houses_pandas
WHERE bdrms = 2;
```

## Querying a Database.

> Note: For this activity, use the database assembled in-class during your demo. As a follow up, you can further use the Postgres database hosted on AWS. 

Practice querying the SQLite database we've created in class using any of the methods you've learnt so far:

- console connection
- python `sqlite3` package
- pandas
- firefox browser extension [SQLite Manager](https://addons.mozilla.org/en-US/firefox/addon/sqlite-manager/?src)

Practice querying the PostgreSQL database you can find at:
```
url: dsi.c20gkj5cvu3l.us-east-1.rds.amazonaws.com
port: 5432
database: dsi
user: dsi_student
password: gastudents
```
    
using:
- console connection
- python `sqlalchemy` package
- pandas

> 
```
from sqlalchemy import create_engine
import pandas as pd
connect_param = 'postgresql://dsi_student:gastudents@dsi.c20gkj5cvu3l.us-east-1.rds.amazonaws.com:5432/northwind'
engine = create_engine(connect_param)
pd.read_sql("SELECT * FROM pg_catalog.pg_tables WHERE schemaname='public'", con=engine)
```

Questions:

1. What's the average price per room for 1 bedroom apartments?
1. What's the average price per room for 2 bedrooms apartments?
1. What's the most frequent apartment size (in terms of bedrooms)?
1. How many are there of that apartment kind?
1. What fraction of the total number are of that kind?
1. How old is the oldest 3 bedrooms apartment?
1. How old is the youngest apartment?
1. What's the average age for the whole dataset?
1. What's the average age for each bedroom size?

Try to answer all these in SQL.

If you finish, try completing the first sections of [SQL zoo](http://www.sqlzoo.net).

In [16]:
from sqlalchemy import create_engine
import pandas as pd
connect_param = 'postgresql://dsi_student:gastudents@dsi.c20gkj5cvu3l.us-east-1.rds.amazonaws.com:5432/northwind'
engine = create_engine(connect_param)
pd.read_sql("SELECT * FROM pg_catalog.pg_tables WHERE schemaname='public'", con=engine)

,schemaname,tablename,tableowner,tablespace,hasindexes,hasrules,hastriggers
0,public,categories,dsi,None,True,False,False
1,public,customercustomerdemo,dsi,None,True,False,False
2,public,customerdemographics,dsi,None,True,False,False
3,public,customers,dsi,None,True,False,False
4,public,employees,dsi,None,True,False,False
5,public,employeeterritories,dsi,None,True,False,False
6,public,order_details,dsi,None,True,False,False
7,public,orders,dsi,None,True,False,False
8,public,products,dsi,None,True,False,False
9,public,region,dsi,None,True,False,False
10,public,shippers,dsi,None,True,False,False
11,public,shippers_tmp,dsi,None,True,False,False
12,public,suppliers,dsi,None,True,False,False
13,public,territories,dsi,None,True,False,False
14,public,usstates,dsi,None,False,False,False
15,public,table1,dsi_student,None,False,False,False
16,public,movies,dsi_student,None,True,False,False
17,public,ratings,dsi_student,None,True,False,False
18,public,categoriesmerged,dsi_student,None,True,False,False